app/controllers/users_controller.rb

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "New Name"], ["email", "new@example.com"], ["password_digest", "$2a$04$0QK.agumgvMEUmpaCnOuM.eLhBtF15p7hn01c7eD0LnYs4/Bk27hu"], ["updated_at", Sun, 08 Jun 2014 05:15:21 UTC +00:00]]